{
  "basics": {
    "name": "Om Khare",
    "label": "MS CS at Georgia Institute of Technology",
    "image": "",
    "email": "omkhare02@gmail.com",
    "phone": "(91) 7709598773",
    "url": "https://omkhare.github.io/"
  },
  "education": [
    {
      "institution": "Georgia Institute of Technology",
      "url": "https://www.gatech.edu/",
      "area": "Computer Science",
      "studyType": "Masters of Science (MS CS)",
      "startDate": "2024-08-01",
      "endDate": "2026-05-01"
    },
    {
      "institution": "College of Engineering Pune Technological University",
      "url": "https://www.coeptech.ac.in/",
      "area": "Computer Engineering",
      "studyType": "B. Tech",
      "startDate": "2021-01-01",
      "endDate": "2024-05-01",
      "score": "10",
      "courses": ["9.24 CGPA","Honors in Data Science"]
    }
  ],
  "work": [
    {
      "name": "Technology Summer Analyst",
      "location": "Pune, India",
      "position": "Deutsche Bank",
      "startDate": "2023-05-15",
      "endDate": "2023-07-15",
      "highlights": ["Designed and implemented a clustering algorithm to categorize comparable privilege session requests, identifying 20% of them with similar characteristics. This led to the automation of these grouped sessions, resulting in a monthly savings of approximately 100 man-hours for the organization.", "Performed sentiment analysis on employee comments on knowledge articles to determine content effectiveness. An increase of 15% in positive feedback was observed, and the results were presented in the form of an analytical dashboard."]
    },
    {
      "name": "Research Intern",
      "location": "Bangalore, India (Remote)",
      "position": "Samsung Prism",
      "startDate": "2023-03-05",
      "endDate": "2023-08-15",
      "highlights": ["Developed an On-Device Graph Database from scratch by providing a SPARQL parser to handle READ, INSERT, DELETE, and FILTER query operations on RDF data", "Outperformed expected performance metrics of 1 ms query plan execution and 20k minimum operations per second while maintaining storage size of approximately twice the raw data size", "ACID properties were ensured by implementing reader-writer locks and multi-threading."]
    },
    {
      "name": "Research Assistant",
      "location": "Pune, India",
      "position": "Mechanical Department, Cummins College of Engineering, Pune",
      "startDate": "2023-01-01",
      "endDate": "2023-02-01",
      "highlights": ["Worked under the guidance of Prof Abhishek Patange to explore the application of machine learning with an emphasis on the white-box model in mechanical domain. 1 paper submitted to a journal."]
    }
  ],
  // "publications": [
  //   {
  //     "name": "Leveraging a Randomized Key Matrix to Enhance the Security of Symmetric Substitution Ciphers",
  //     "publisher": "10th IEEE CSDE 2023",
  //     "releaseDate": "2023-11-18",
  //     "url": "https://arxiv.org/abs/2311.18085",
  //     "summary": "An innovative strategy to enhance the security of symmetric substitution ciphers is presented, through the implementation of a randomized key matrix suitable for various file formats, including but not limited to binary and text files. Despite their historical relevance, symmetric substitution ciphers have been limited by vulnerabilities to cryptanalytic methods like frequency analysis and known plaintext attacks. The aim of our research is to mitigate these vulnerabilities by employing a polyalphabetic substitution strategy that incorporates a distinct randomized key matrix. This matrix plays a pivotal role in generating a unique random key, comprising ASCII characters, encompassing both uppercase and lowercase letters, numeric, and special characters, to derive the corresponding ciphertext. The effectiveness of the proposed methodology in enhancing the security of conventional substitution methods for file encryption and decryption is supported by comprehensive testing and analysis, which encompass computational speed, frequency analysis, keyspace examination, Kasiski test, entropy analysis, and the utilization of a large language model."
  //   },
  //   {
  //     "name": "YOLOv8-Based Visual Detection of Road Hazards: Potholes, Sewer Covers, and Manholes",
  //     "publisher": "IEEE PuneCon 2023",
  //     "releaseDate": "2023-12-03",
  //     "url": "https://arxiv.org/abs/2311.00073",
  //     "summary": "Effective detection of road hazards plays a pivotal role in road infrastructure maintenance and ensuring road safety. This research paper provides a comprehensive evaluation of YOLOv8, an object detection model, in the context of detecting road hazards such as potholes, Sewer Covers, and Man Holes. A comparative analysis with previous iterations, YOLOv5 and YOLOv7, is conducted, emphasizing the importance of computational efficiency in various applications. The paper delves into the architecture of YOLOv8 and explores image preprocessing techniques aimed at enhancing detection accuracy across diverse conditions, including variations in lighting, road types, hazard sizes, and types. Furthermore, hyperparameter tuning experiments are performed to optimize model performance through adjustments in learning rates, batch sizes, anchor box sizes, and augmentation strategies. Model evaluation is based on Mean Average Precision (mAP), a widely accepted metric for object detection performance. The research assesses the robustness and generalization capabilities of the models through mAP scores calculated across the diverse test scenarios, underlining the significance of YOLOv8 in road hazard detection and infrastructure maintenance."
  //   },
  //   {
  //     "name": "Making informed decisions in cutting tool maintenance in milling: A KNN-based model agnostic approach",
  //     "publisher": "Arxiv",
  //     "releaseDate": "2023-11-01",
  //     "url": "https://arxiv.org/abs/2310.14629",
  //     "summary": "In machining processes, monitoring the condition of the tool is a crucial aspect to ensure high productivity and quality of the product. Using different machine learning techniques in Tool Condition Monitoring TCM enables a better analysis of the large amount of data of different signals acquired during the machining processes. The real time force signals encountered during the process were acquired by performing numerous experiments. Different tool wear conditions were considered during the experimentation. A comprehensive statistical analysis of the data and feature selection using decision trees was conducted, and the KNN algorithm was used to perform classification. Hyperparameter tuning of the model was done to improve the models performance. Much research has been done to employ machine learning approaches in tool condition monitoring systems, however, a model agnostic approach to increase the interpretability of the process and get an in depth understanding of how the decision making is done is not implemented by many. This research paper presents a KNN based white box model, which allows us to dive deep into how the model performs the classification and how it prioritizes the different features included. This approach helps in detecting why the tool is in a certain condition and allows the manufacturer to make an informed decision about the tools maintenance."
  //   }
  // ],
  "projects": [
    {
      "name": "Laboratory Inventory Management System (LIMS)",
      "location": "Pune, India",
      "position": "High Explosives Factory, Khadki, Pune",
      "startDate": "2022-07-01",
      "endDate": "2023-03-01",
      "highlights": ["Served as Project Lead", "Project done for a chemical lab at an ordnance factory under Department of Computer Engineering, COEP Technological Univeristy"]
    }
  ],
  "volunteer": [
    {
      "organization": "Project Manager",
      "position": "Software Development Society, COEP",
      "startDate": "2021-09-01",
      "endDate": "Present",
      "highlights": ["Core member of the student-led software development club in the college with 30 members. Responsible for overseeing client interactions and effectively coordinating project timelines and deliverables, ensuring successful project execution."]
    },
    {
      "organization": "Web and App Head",
      "position": "Mindspark Annual Technical Fest, COEP",
      "startDate": "2022-07-01",
      "endDate": "2023-02-01",
      "highlights": ["Led a team of 20 coordinators to build and deploy the app and website for Mindspark’22, COEP’s Annual National Level Technical Fest, which got 30k+ unique visitors."]
    },
    {
      "organization": "Volunteer",
      "position": "Paakhi Initiative",
      "startDate": "2022-06-01",
      "endDate": "2023-02-01",
      "highlights": ["Conducted an App Development Workshop using MIT AppInventor software for underprivileged girls from a rural school in Pune.", "Associated with the Paakhi initiative in providing laptops to rural schools in Pune."]
    }
  ],
  "skills": [
    {
      "name": "Machine Learning",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Computer Vision - YOLO, OpenCV",
        "NLP - NER, Summarization, Sentiment Analysis, Language Modelling",
        "Tensorflow, PyTorch",
        "Numpy, Pandas"
      ]
    },
    {
      "name": "Programming Languages",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "C/C++",
        "Python",
        "Javascript"
      ]
    },
    {
      "name": "Web Development",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "MERN Stack",
        "Django",
        "React Native",
        "PHP",
        "SQL"
      ]
    },
    {
      "name": "Relevant Coursework",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Operating Systems",
        "Database Management Systems",
        "Data Structures",
        "Computer Networks",
        "Artificial Intelligence",
        "Data Science",
        "Design and Analysis of Algorithms"
      ]
    }
  ],
  "awards": [
    {
      "title": "Winner",
      "date": "Nov, 2021",
      "awarder": "Mindspark, COEP",
      "url": "https://drive.google.com/file/d/1-rVQWYh5UbWZGsXbMFkUP_1_eHultGD3/view?usp=sharing",
      "summary": "First prize amongst 120+ teams across the nation"
    },
    {
      "title": "2nd Rank",
      "date": "Jan, 2022",
      "awarder": "PASCKATHON 3.0",
      "summary": "2nd prize in Hackathon conducted by PICT College. Also got a chance to work for a startup"
    },
    {
      "title": "2nd Rank",
      "date": "Mar, 2022",
      "awarder": "Inspiron '22",
      "summary": "2nd prize in Hackathon conducted by Computer Society of India"
    },
    {
      "title": "Finalist",
      "date": "June, 2022",
      "awarder": "Smart India Hackathon"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Hindi",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Marathi",
      "fluency": "Native Speaker"
    }
  ]
}
